#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-Z66xJYKi8SuVfSNL

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_container_registry.repository: Refreshing state... [id=openarabic]
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
data.digitalocean_kubernetes_cluster.openarabic: Reading...
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 0s [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.flagger: Refreshing state... [id=flagger]
helm_release.loadtester: Refreshing state... [id=loadtester]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.flagger will be updated in-place
  ~ resource "helm_release" "flagger" {
        id                         = "flagger"
        name                       = "flagger"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "meshProvider" -> null
          - value = "istio" -> null
        }
      + set {
          + name  = "meshProvider"
          + value = "istio"
        }
      + set {
          + name  = "metricsServer"
          + value = "http://prometheus.istio-system:9090"
        }
      + set {
          + name  = "namespace"
          + value = "openarabic"
        }
      - set {
          - name  = "prometheus.install" -> null
          - value = "true" -> null
        }
    }

  # helm_release.istio-ingress must be replaced
-/+ resource "helm_release" "istio-ingress" {
      ~ id                         = "istio-ingress" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "1.14.0"
              - chart       = "gateway"
              - name        = "istio-ingress"
              - namespace   = "openarabic"
              - revision    = 1
              - values      = "null"
              - version     = "1.14.0"
            },
        ] -> (known after apply)
        name                       = "istio-ingress"
      ~ namespace                  = "openarabic" -> "gateway" # forces replacement
        # (24 unchanged attributes hidden)
    }

  # kubernetes_namespace.gateway will be created
  + resource "kubernetes_namespace" "gateway" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
            }
          + name             = "gateway"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "TF_VAR_do_token" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Z66xJYKi8SuVfSNL/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*